request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.dataaccess.com/webservicesserver/">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:NumberToWords>
            <gs:ubiNum>510</gs:ubiNum>
        </gs:NumberToWords>
    </soapenv:Body>
</soapenv:Envelope>