src/test/resources/file/numbertowords/numberToWords.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <NumberToWords xmlns="http://www.dataaccess.com/webservicesserver/">
            <ubiNum>[number]</ubiNum>
        </NumberToWords>
    </soap:Body>
</soap:Envelope>